{
    "DOS Chinese Simplified" = "\U7b80\U4f53\U4e2d\U6587 (Windows, DOS)";
    "DOS Chinese Traditional" = "\U7e41\U4f53\U4e2d\U6587 (Windows, DOS)";
    "DOS Cyrillic" = "\U897f\U91cc\U5c14\U6587 (DOS)";
    "DOS Russian" = "\U4fc4\U6587 (DOS)";
    DOSJapanese = "\U65e5\U6587 (Windows, DOS, ShiftJIS )";
    "EUC_JP" = "\U65e5\U6587 (EUC)";
    "GB 18030" = "\U4e2d\U6587 (GB 18030)";
    "GB 2312" = "\U7b80\U4f53\U4e2d\U6587 (GB 2312)";
    GBK = "\U4e2d\U6587 (GBK)";
    IsoLatin = "\U897f\U6587 (ISO Latin 1)";
    IsoLatin2 = "\U4e2d\U6b27\U8bed\U7cfb (ISO Latin 2)";
    IsoLatin5 = "\U571f\U8033\U5176 (ISO Latin 5)";
    IsoLatin9 = "\U897f\U6587 (ISO Latin 9)";
    IsoLatinGreek = "\U5e0c\U814a\U6587 (ISO 8859-7)";
    JISJapanese = "\U65e5\U6587 (ISO 2022-JP)";
    "KOI8_R" = "\U4fc4\U6587 (KOI8-R)";
    "Mac Central European Roman" = "Mac \U4e2d\U6b27\U8bed\U7cfb";
    "Mac Chinese Simplified" = "\U7b80\U4f53\U4e2d\U6587 (Mac OS)";
    "Mac Chinese Traditional" = "\U7e41\U4f53\U4e2d\U6587 (Mac OS)";
    "Mac Cyrillic" = "\U897f\U91cc\U5c14\U6587 (Mac OS)";
    MacJapanese = "\U65e5\U6587 (Mac OS, ShiftJIS \U00a5)";
    MacKorean = "\U97e9\U6587 (Mac OS)";
    MacOSRoman = "\U897f\U6587 (Mac OS Roman)";
    "SJIS_X0213" = "\U65e5\U6587 (Shift JIS X0213)";
    "Standard Unicode" = "Unicode (UTF-16)";
    "UTF-8 Unicode" = "Unicode (UTF-8)";
    "Windows Cyrillic" = "\U897f\U91cc\U5c14\U6587 (Windows)";
    "Windows Latin 1" = "Windows Latin 1";
    WindowsCentralEurRoman = "\U4e2d\U6b27\U8bed\U7cfb (Windows)";
}